app/Models/Student/DefaultModel.php

		public function fetchLevelListModel($category_short_name=''){
			$builder = $this->db->table('level_table');
			$builder->select('level_table.*,category_table.category_short_name,category_table.category_name');
			$builder->join('category_table','category_table.category_id=level_table.category_id','left');
			$builder->where('level_table.deleted',0);
			$builder->where('category_table.deleted',0);
			$builder->where('category_table.active',1);
			if (!empty($category_short_name)) {
				$builder->where('category_table.category_short_name',$category_short_name);
			}
			$response = $builder->get()->getResult();
---
SELECT `level_table`.*, `category_table`.`category_short_name`, `category_table`.`category_name`
FROM `level_table`
LEFT JOIN `category_table` ON `category_table`.`category_id`=`level_table`.`category_id`
WHERE `level_table`.`deleted` = 0
AND `category_table`.`deleted` = 0
AND `category_table`.`active` = 1

	    public function fetchAvailableSubject($cart_id='',$limit=''){
	        $builder = $this->db->table('cart_items_table');
	        $builder->select('cart_items_table.*, subject_table.subject_name,type_table.type_name,level_table.level_name,type_table.schedule_file,type_table.access');
	        $builder->join('subject_table','subject_table.subject_id=cart_items_table.subject_id','left');
	        $builder->join('type_table','type_table.type_id=subject_table.type_id','left');
	        $builder->join('level_table','level_table.level_id=subject_table.level_id','left');
	        $builder->join('category_table','level_table.level_id=subject_table.level_id','left');
	        if (!empty($cart_id)) {
	            $builder->where('cart_items_table.cart_id',$cart_id);
	            $builder->where('cart_items_table.payment_status','PAID');
	        }
	        $builder->where('cart_items_table.active','1');
	        $builder->where('cart_items_table.access',1);
	        if (!empty($limit)) {
	            $builder->limit($limit);
	        }
	        return $builder->get()->getResultArray();
---
SELECT `cart_items_table`.*, `subject_table`.`subject_name`, `type_table`.`type_name`, `level_table`.`level_name`, `type_table`.`schedule_file`, `type_table`.`access`
FROM `cart_items_table`
LEFT JOIN `subject_table` ON `subject_table`.`subject_id`=`cart_items_table`.`subject_id`
LEFT JOIN `type_table` ON `type_table`.`type_id`=`subject_table`.`type_id`
LEFT JOIN `level_table` ON `level_table`.`level_id`=`subject_table`.`level_id`
LEFT JOIN `category_table` ON `level_table`.`level_id`=`subject_table`.`level_id`
WHERE `cart_items_table`.`cart_id` = '2'
AND `cart_items_table`.`payment_status` = 'PAID'
AND `cart_items_table`.`active` = '1'
AND `cart_items_table`.`access` = 1
 LIMIT 3

	    public function getNotesSubjectList($cart_id='',$limit=''){
	        $builder = $this->db->table('cart_items_table');
	        $builder->select('cart_items_table.*,subject_table.subject_name');
	        $builder->join('subject_table','subject_table.subject_id = cart_items_table.subject_id','left');
	        $builder->join('notes_table','cart_items_table.subject_id = notes_table.subject_id');
	        $builder->join('type_table','type_table.type_id = subject_table.type_id','left');
	        $builder->where('cart_items_table.cart_id',$cart_id);
	        $builder->where('cart_items_table.payment_status','PAID');
	        $builder->where('cart_items_table.active','1');
	        $builder->where('cart_items_table.access','1');
	        $builder->where('notes_table.deleted',0);
	        $builder->orderBy('subject_table.subject_id','ASC');
	        $builder->groupBy('subject_name');
	        if (!empty($limit)) {
	            $builder->limit($limit);
	        }
	        $records = $builder->get()->getResult();
---
SELECT `cart_items_table`.*, `subject_table`.`subject_name`
FROM `cart_items_table`
LEFT JOIN `subject_table` ON `subject_table`.`subject_id` = `cart_items_table`.`subject_id`
JOIN `notes_table` ON `cart_items_table`.`subject_id` = `notes_table`.`subject_id`
LEFT JOIN `type_table` ON `type_table`.`type_id` = `subject_table`.`type_id`
WHERE `cart_items_table`.`cart_id` = '2'
AND `cart_items_table`.`payment_status` = 'PAID'
AND `cart_items_table`.`active` = '1'
AND `cart_items_table`.`access` = '1'
AND `notes_table`.`deleted` = 0
GROUP BY `subject_name`
ORDER BY `subject_table`.`subject_id` ASC
 LIMIT 3

	    public function getAmendmentSubjectList($cart_id='',$limit=''){
	        $builder = $this->db->table('cart_items_table');
	        $builder->select('cart_items_table.*,subject_table.subject_name');
	        $builder->join('subject_table','subject_table.subject_id = cart_items_table.subject_id','left');
	        $builder->join('amendment_table','cart_items_table.subject_id = amendment_table.subject_id');
	        $builder->join('type_table','type_table.type_id = subject_table.type_id','left');
	        $builder->where('cart_items_table.cart_id',$cart_id);
	        $builder->where('cart_items_table.payment_status','PAID');
	        $builder->where('cart_items_table.active','1');
	        $builder->where('cart_items_table.access','1');
	        $builder->where('amendment_table.deleted',0);
	        $builder->orderBy('subject_table.subject_id','ASC');
	        $builder->groupBy('subject_name');
	        if (!empty($limit)) {
	            $builder->limit($limit);
	        }
	        $records = $builder->get()->getResult();
---
SELECT `cart_items_table`.*, `subject_table`.`subject_name`
FROM `cart_items_table`
LEFT JOIN `subject_table` ON `subject_table`.`subject_id` = `cart_items_table`.`subject_id`
JOIN `amendment_table` ON `cart_items_table`.`subject_id` = `amendment_table`.`subject_id`
LEFT JOIN `type_table` ON `type_table`.`type_id` = `subject_table`.`type_id`
WHERE `cart_items_table`.`cart_id` = '2'
AND `cart_items_table`.`payment_status` = 'PAID'
AND `cart_items_table`.`active` = '1'
AND `cart_items_table`.`access` = '1'
AND `amendment_table`.`deleted` = 0
GROUP BY `subject_name`
ORDER BY `subject_table`.`subject_id` ASC
 LIMIT 3

	    public function getQbankSubjectList($cart_id='',$limit=''){
	        $builder = $this->db->table('cart_items_table');
	        $builder->select('cart_items_table.*,subject_table.subject_name');
	        $builder->join('subject_table','subject_table.subject_id = cart_items_table.subject_id','left');
	        $builder->join('qbank_table','cart_items_table.subject_id = qbank_table.subject_id');
	        $builder->join('type_table','type_table.type_id = subject_table.type_id','left');
	        $builder->where('cart_items_table.cart_id',$cart_id);
	        $builder->where('cart_items_table.payment_status','Credit');
	        $builder->where('cart_items_table.active','1');
	        $builder->where('cart_items_table.access','1');
	        $builder->where('qbank_table.deleted',0);
	        $builder->orderBy('subject_table.subject_id','ASC');
	        $builder->groupBy('subject_name');
	        if (!empty($limit)) {
	            $builder->limit($limit);
	        }
	        $records = $builder->get()->getResult();
---
SELECT `cart_items_table`.*, `subject_table`.`subject_name`
FROM `cart_items_table`
LEFT JOIN `subject_table` ON `subject_table`.`subject_id` = `cart_items_table`.`subject_id`
JOIN `qbank_table` ON `cart_items_table`.`subject_id` = `qbank_table`.`subject_id`
LEFT JOIN `type_table` ON `type_table`.`type_id` = `subject_table`.`type_id`
WHERE `cart_items_table`.`cart_id` = '2'
AND `cart_items_table`.`payment_status` = 'Credit'
AND `cart_items_table`.`active` = '1'
AND `cart_items_table`.`access` = '1'
AND `qbank_table`.`deleted` = 0
GROUP BY `subject_name`
ORDER BY `subject_table`.`subject_id` ASC
 LIMIT 3

	    public function getScheduleList($cart_id=''){
	    	$builder = $this->db->table('cart_items_table');
	        $builder->select('cart_items_table.*,type_table.schedule_file,type_table.type_name');
	        $builder->join('subject_table','subject_table.subject_id=cart_items_table.subject_id','left');
	        $builder->join('type_table','type_table.type_id=subject_table.type_id','left');
	        $builder->where('cart_id',$cart_id);
	        $builder->where('payment_status','Credit');
	        $builder->where('cart_items_table.access','1');
	        $builder->where('cart_items_table.active','1');
	        $builder->groupBy('cart_items_table.subject_id');
	        $builder->limit(3);
	        $builder->orderBy('cart_items_table.cart_items_id','desc');
	        $response = $builder->get()->getResult();
---
SELECT `cart_items_table`.*, `type_table`.`schedule_file`, `type_table`.`type_name`
FROM `cart_items_table`
LEFT JOIN `subject_table` ON `subject_table`.`subject_id`=`cart_items_table`.`subject_id`
LEFT JOIN `type_table` ON `type_table`.`type_id`=`subject_table`.`type_id`
WHERE `cart_id` = '2'
AND `payment_status` = 'Credit'
AND `cart_items_table`.`access` = '1'
AND `cart_items_table`.`active` = '1'
GROUP BY `cart_items_table`.`subject_id`
ORDER BY `cart_items_table`.`cart_items_id` DESC
 LIMIT 3